[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:27:24
     // Stryker disable next-line all
    // const itemId_regex = /[\d]+/; // Accepts from 1900-2099 followed by 1-4.  Close enough.
     const itemId_regex = /\d+/;
-    const stars_regex= /[1|2|3|4|5]/;
+    const stars_regex= /[^1|2|3|4|5]/;
     const email_regex = /\S+@\S+\.\S+/;
 
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:34:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-                {initialContents && (
-
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="MenuItemReviewForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-
-                )}
+                {true}
 
 
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:34:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-                {initialContents && (
-
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="MenuItemReviewForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-
-                )}
+                {false}
 
 
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:127:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'datereviewed is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /datereviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:127:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'datereviewed is required. '}
+                            {errors.dateReviewed || 'datereviewed is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
