[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:28:25
    // const itemId_regex = /[\d]+/; // Accepts from 1900-2099 followed by 1-4.  Close enough.
     const itemId_regex = /\d+/;
     const stars_regex= /[1|2|3|4|5]/;
-    const email_regex = /\S@\S+\.\S/;
+    const email_regex = /\S@\S\.\S/;
 
 
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:35:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-                {initialContents && (
-
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="MenuItemReviewForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-
-                )}
+                {initialContents || <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="MenuItemReviewForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>}
 
 
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:59:52
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", {
-                                required: "Item Id is required.",
-                                pattern: {
-                                    value: itemId_regex,
-                                    message: "Item Id must be a number"
-                                },
-                            })}
+                            {...register("itemId", {})}
                          />
                          <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Item Id is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:61:42
                             isInvalid={Boolean(errors.itemId)}
                             {...register("itemId", {
                                 required: "Item Id is required.",
-                                pattern: {
-                                    value: itemId_regex,
-                                    message: "Item Id must be a number"
-                                },
+                                pattern: {},
                             })}
                          />
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item Id must be a number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:104:34
                             isInvalid={Boolean(errors.stars)}
                             {...register("stars", {
                         required: "Stars are required.",
-                        pattern: {
-                            value: stars_regex,
-                            message: "between 1 and 5"
-                            },
+                        pattern: {},
                         })}
                         />
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:128:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'datereviewed is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /datereviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:141:43
                             type="text"
                             isInvalid={Boolean(errors.comments)}
                             {...register("comments", {
-                                required: "Comments is required."
+                                required: ""
                             })}
                         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
