[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:14:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/ucsbdiningcommonsmenuitem/create"
-                style={{ float: "right" }}
-            >
-                Create UCSBDiningCommonsMenuItem 
-            </Button>
-        )
-    } 
-  }
+  const createButton = () => {}
   
   const { data: items, error: _error, status: _status } =
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDiningCommonsMenuItem/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:33:7
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/ucsbdiningcommonsmenuitem/all"],
       { method: "GET", url: "/api/ucsbdiningcommonsmenuitem/all" },
-      []
+      ["Stryker was here"]
     );
 
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id" role="cell" /> instead
