[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:52:37
                     isInvalid={Boolean(errors.orgTranslationShort)}
                     {...register("orgTranslationShort", {
                         required: "Shorthand Title is required.",
-                        maxLength : {
-                            value: 55,
-                            message: "Max length 55 characters"
-                        }
+                        maxLength : {}
                     })}
                     />
killedBy: UCSBOrganizationForm tests just as planned- maxlength
statusReason: Error: Unable to find an element with the text: /Max length 55 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:54:38
                         required: "Shorthand Title is required.",
                         maxLength : {
                             value: 55,
-                            message: "Max length 55 characters"
+                            message: ""
                         }
                     })}
killedBy: UCSBOrganizationForm tests just as planned- maxlength
statusReason: Error: Unable to find an element with the text: /Max length 55 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:75:35
                     type="text"
                     isInvalid={Boolean(errors.orgTranslation)}
                     {...register("orgTranslation", {
-                        required: "Full Title is required."
+                        required: ""
                     })}
                 />
killedBy: UCSBOrganizationForm tests just as planned- maxlength
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Full Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:93:30
                 data-testid={testIdPrefix + "-inactive"}
                 id="inactive"
                 as="select"
-                {...register("inactive", )}
+                {...register("", )}
                 >
                 <option value="true" selected>true</option>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
