[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:33:39
                         id="orgCode"
                         type="text"
                         {...register("orgCode" , {
-                            required: "orgCode is required."
+                            required: ""
                         })}
 
killedBy: UCSBOrganizationForm tests just as planned: select Inactive status
statusReason: TypeError: e is not a function
