[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:56:60
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", {
-                                required: "RequesterEmail is required.",
-                                maxLength : {
-                                    value: 320,
-                                    message: "Max length 320 characters"
-                                }
-                            })}
+                            {...register("requesterEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /RequesterEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:58:45
                             isInvalid={Boolean(errors.requesterEmail)}
                             {...register("requesterEmail", {
                                 required: "RequesterEmail is required.",
-                                maxLength : {
-                                    value: 320,
-                                    message: "Max length 320 characters"
-                                }
+                                maxLength : {}
                             })}
                         />
killedBy: RecommendationRequestForm tests Error on requester email exceeding 320 characters
statusReason: Error: Unable to find an element with the text: /Max length 320 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:74:42
                     <Form.Group className="mb-3" >
                         <Form.Label htmlFor="professorEmail">Professor Email</Form.Label>
                         <Form.Control
-                            data-testid={"RecommendationRequestForm-professorEmail"}
+                            data-testid={""}
                             id="professorEmail"
                             type="text"
killedBy: RecommendationRequestForm tests Error on professor email exceeding 320 characters
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestForm-professorEmail"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:78:60
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", {
-                                required: "ProfessorEmail is required.",
-                                maxLength : {
-                                    value: 320,
-                                    message: "Max length 320 characters"
-                                }
-                            })}
+                            {...register("professorEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /ProfessorEmail is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:82:46
                                 required: "ProfessorEmail is required.",
                                 maxLength : {
                                     value: 320,
-                                    message: "Max length 320 characters"
+                                    message: ""
                                 }
                             })}
killedBy: RecommendationRequestForm tests Error on professor email exceeding 320 characters
statusReason: Error: Unable to find an element with the text: /Max length 320 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:98:42
                     <Form.Group className="mb-3" >
                         <Form.Label htmlFor="explanation">Explanation</Form.Label>
                         <Form.Control
-                            data-testid={"RecommendationRequestForm-explanation"}
+                            data-testid={""}
                             id="explanation"
                             type="text"
killedBy: RecommendationRequestForm tests Error on professor email exceeding 320 characters
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestForm-explanation"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:138:42
                             id="dateNeeded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateNeeded)}
-                            {...register("dateNeeded", { required: true, pattern: isodate_regex })}
+                            {...register("", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:154:42
                             id="done"
                             type="switch"
                             isInvalid={Boolean(errors.done)}                        
-                            {...register("done")}
+                            {...register("")}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
