[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/RecommendationRequest/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/RecommendationRequest/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:39:9
             Header: 'Requester Email',
             accessor: 'requesterEmail',
         },
-        {
-            Header: 'Professor Email',
-            accessor: 'professorEmail',
-        },
+        {},
         {
             Header: 'Explanation',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:58:19
         {
             Header: 'Done',
             accessor: 'done',
-            Cell: ({ cell }) => (
-                <span>
-                    {cell.value ? "true" : "false"}
-                </span>
-            )
+            Cell: () => undefined
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:60:35
             accessor: 'done',
             Cell: ({ cell }) => (
                 <span>
-                    {cell.value ? "true" : "false"}
+                    {cell.value ? "" : "false"}
                 </span>
             )
