[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/RecommendationRequest",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: RecommendationRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/RecommendationRequest"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/RecommendationRequest",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: RecommendationRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {
